# Manager report

1. a) Which movies are longer than 3 hours (180 minutes), show the title and its length?

In [12]:
import duckdb

duckdb_path = "data/sakila.duckdb"

with duckdb.connect(duckdb_path) as conn:
    film_len180 = conn.sql("""
        SELECT
            title,
            length
        FROM
            film
        WHERE
            length > 180;
    """).df()

film_len180.index = film_len180.index + 1
film_len180

                 title  length
1     ANALYZE HOOSIERS     181
2      BAKED CLEOPATRA     182
3        CATCH AMISTAD     183
4        CHICAGO NORTH     185
5    CONSPIRACY SPIRIT     184
6       CONTROL ANTHEM     185
7     CRYSTAL BREAKING     184
8       DARN FORRESTER     185
9       FRONTIER CABIN     183
10         GANGS PRIDE     185
11    HAUNTING PIANIST     181
12           HOME PITY     185
13     HOTEL HAPPINESS     181
14      INTRIGUE WORST     181
15       JACKET FRISCO     181
16      KING EVOLUTION     184
17      LAWLESS VISION     181
18       LOVE SUICIDES     181
19       MONSOON CAUSE     182
20     MOONWALKER FOOL     184
21       MUSCLE BRIGHT     185
22        POND SEATTLE     185
23       RECORDS ZORRO     182
24          REDS POCUS     182
25  RUNAWAY TENENBAUMS     181
26         SATURN NAME     182
27       SCALAWAG DUCK     183
28      SEARCHERS WAIT     182
29     SMOOCHY CONTROL     184
30  SOLDIERS EVOLUTION     185
31      SONS INTERVIEW     184
32      SORORITY QUEEN     184
33      STAR OPERATION     181
34   SWEET BROTHERHOOD     185
35      THEORY MERMAID     184
36           WIFE TURN     183
37         WILD APOLLO     181
38        WORST BANGER     185
39      YOUNG LANGUAGE     183

1. b) Which movies are longer than 3 hours (180 minutes), show the title and its length?
- Note: Only movies that have the word "love" is on the list. This means that movies with "lovely" will not be a part of the list.

In [13]:
import pandas as pd

pd.set_option("display.max_colwidth", None)

with duckdb.connect(duckdb_path) as conn:
    film_love = conn.sql("""
        SELECT
            title,
            rating,
            length,
            description
        FROM
            film
        WHERE
            title LIKE '% LOVE' OR
            title LIKE 'LOVE %' OR
            title LIKE '% LOVE %';
    """).df()

film_love.index = film_love.index + 1
film_love

,title,rating,length,description
1,GRAFFITI LOVE,PG,117,A Unbelieveable Epistle of a Sumo Wrestler And a Hunter who must Build a Composer in Berlin
2,IDAHO LOVE,PG-13,172,A Fast-Paced Drama of a Student And a Crocodile who must Meet a Database Administrator in The Outback
3,INDIAN LOVE,NC-17,135,A Insightful Saga of a Mad Scientist And a Mad Scientist who must Kill a Astronaut in An Abandoned Fun House
4,LAWRENCE LOVE,NC-17,175,A Fanciful Yarn of a Database Administrator And a Mad Cow who must Pursue a Womanizer in Berlin
5,LOVE SUICIDES,R,181,A Brilliant Panorama of a Hunter And a Explorer who must Pursue a Dentist in An Abandoned Fun House

1. c) Calculate descriptive statistics on the length column

In [14]:
with duckdb.connect(duckdb_path) as conn:
    film_length = conn.sql("""
        SELECT
            MIN(length) AS Shortest_min,
            round(AVG(length),0)::INT AS Average_min,
            round(MEDIAN(length),0)::INT AS Median_min,
            MAX(length) AS Longest_min
        FROM
            film;
    """).df()

film_length

   Shortest_min  Average_min  Median_min  Longest_min
0            46          115         114          185

1. d)  The 10 most expensive movies to rent per day

In [17]:
with duckdb.connect(duckdb_path) as conn:
    film_dayrent = conn.sql("""
        SELECT
            title,
            round((rental_rate / rental_duration),2) AS Rent_per_day
        FROM
            film
        ORDER BY
            Rent_per_day DESC,
            title ASC
        LIMIT
            10;
    """).df()

film_dayrent.index = film_dayrent.index + 1
film_dayrent

                  title  Rent_per_day
1        ACE GOLDFINGER          1.66
2       AMERICAN CIRCUS          1.66
3           AUTUMN CROW          1.66
4   BACKLASH UNDEFEATED          1.66
5       BEAST HUNCHBACK          1.66
6      BEHAVIOR RUNAWAY          1.66
7       BILKO ANONYMOUS          1.66
8     CARIBBEAN LIBERTY          1.66
9      CASPER DRAGONFLY          1.66
10    CASUALTIES ENCINO          1.66

1. e)  Which actors have played in most movies?

In [16]:
with duckdb.connect(duckdb_path) as conn:
    most_movies = conn.sql("""
        SELECT
            a.first_name || ' ' || a.last_name AS Actor,
            COUNT(*) AS Nr_movies
        FROM
            film_actor fa
        LEFT JOIN actor a ON a.actor_id = fa.actor_id
        GROUP BY
            Actor
        ORDER BY
            Nr_movies DESC
        LIMIT
            10;
    """).df()

most_movies.index = most_movies.index + 1
most_movies

                 Actor  Nr_movies
1          SUSAN DAVIS         54
2       GINA DEGENERES         42
3          WALTER TORN         41
4          MARY KEITEL         40
5       MATTHEW CARREY         39
6        SANDRA KILMER         37
7       SCARLETT DAMON         36
8   ANGELA WITHERSPOON         35
9          HENRY BERRY         35
10     VIVIEN BASINGER         35